{
  "CS F111": [
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Well, she was the IC back when I took this course. Safe to say I feel like she failed at her job. She doesn't explain the concepts properly and is kind of standoff-ish. Like, she's rude and is not accommodating to doubts and interactions with students. Buckle up if she's your IC kids, make sure to understand logic and everything else on your own because let me be the first to tell you, she will not help you.\nNeso academy and daily practice from hacker rank ftw.\n-R\n\nP.S. If you want a taste of her paper, just check the paper from 2022 batch."
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "He makes complex topics easy to understand. Attend classes or watch impartus. He's one of the best you can have for CP. Also his labs are lite"
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Don't expect a lot from the IC, self study required. Papers are tricky and hard if you're not used to programming logic."
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Okay, this guy and Pragathi Srivastava...are a killer combo. As in they will KILL your cgpa if you're not careful. If the 2 are together (RIP '22 batch kids) prefer this dude, you'll see that he at least puts in the effort to explain stuff unlike the latter.\nPutting the comparison aside, he's just not very good in my opinion. Which is sad, considering this course is the foundation and many people's first taste of programming and logic.\nAs always, Neso Academy and daily practice from Hackerrank ftw.\n-R"
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Didn't attend many of his classes. While not a bad teacher, he's not a great teacher either. Constantly felt bored in his class and often felt that he wasn't able to explain concepts properly."
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Good I/C. Good Teacher. Good Grading. W course."
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "It is essential to practice programs regularly by yourself. Do it by your own logic first and discuss with peers and teachers before checking solution. Also practice PYQ's before exams to cover mugging up stuff like size of different data types, binary numbers, hexadecimal numbers etc. Dilligently do all lab programs even if you don't attend lecture classes. All the best!"
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Watch Apna College to survive in this course.. otherwise u can't even imagine where u'll end up!"
    },
    {
      "professor": "Dave Jay Kamlesh",
      "comment": "Sirs lab section quizzes are slightly harder than other sections (actually significantly harder) but the knowledge obtained in his lab makes it worth while."
    }
  ],
  "CS F211": [
    {
      "professor": "Venkatakrishnan Ramaswamy",
      "comment": "The course seemed to be evenly paced and covered the handout thoroughly. The labs were very helpful in understanding the course material and application. Their being evaluative forced us to actually focus on the application as well since the course under Dr. Bhanumurthy was highly mathematical/theoretical and less application-based. The combination of the two made the course an enjoyable experience."
    },
    {
      "professor": "Venkatakrishnan Ramaswamy",
      "comment": "Guy loves c, didn’t even allow cpp in labs, not very great in class either"
    },
    {
      "professor": "Venkatakrishnan Ramaswamy",
      "comment": "Not a great professor, there's a difference between knowing the concept and knowing how to teach it. Self study is the way to go with this prof. Course was intensive, weekly assignments were a pain but definitely very useful for such an important course. Grading was decent."
    }
  ],
  "CS F212": [
    {
      "professor": "J Jabez Christopher",
      "comment": "- Gives special worksheets to students who attend his classes\n- Purposely deletes few slides and uploads them on CMS quite late\n- Doesn't speak in mic , so impartus is waste\n- Graded bad in project to everyone who didnt consult him\nOverall moderate professor(teaching wise), but you'll do well with him provided you attend his lectures and maintain regular interaction with him"
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "Teaches his own stuff, voice not very clear, better go to class"
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "Pretty simple course, prof isn't great and is very unclear in impartus so better go to classes. Lab components are very chill as well. Grading is standard for CS profs with C at av."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "The course was made highly theoretical by the professor and the papers were made in a school-like manner, purely memorization-based, leading to incredibly high averages in all components. The material was, however, covered well at an even pace. The project was not very complicated, nor was it impressive enough to add in our resumes, pretty much a waste of time."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "Very useful course for placements and si. the prof himself is also very nice and his papers tend to be mainly from what he teaches only. nothing goes out of the scope of the classroom. Has some issues with slides but should be fine and manageable if you read the textbook"
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "I just can't with this guy. He pops up every sem and repeats the same shit. Makes extremely easy papers and average inflates as high as 75-80%. The result is 3-4 mark grade ranges on extremes and 20-25 marks at average. Otherwise he teaches well, but speaks very slowly (2x on impartus ftw)"
    }
  ],
  "CS F213": [
    {
      "professor": "Aritra Mukherjee",
      "comment": "His lectures were great, one could really understand what he wants to convey and wrote codes from scratch live to see the working of everything and clear any doubts in the process.\nQuite debatable but I found his assignments to be good too. He almost only asked what he taught in class and took the assignments seriously and they were individual too, thus low averages:) Only issue was his bad mids grading(compre not out yet) and evaluations had poor execution at times.\nI really feel like I learnt something properly from this course."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Expects you to have a sound understanding of java beforehand so if you don’t have any experience with java then you’ll need to learn the basics on your own. He usually asks  theory from his slide so read his slides thoroughly."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "The course+prof combo will teach you everything you ever need to know related to oops but you need to put in double the effort to keep up with the coursework. Every topic is kinda rushed up but it's useful at the end of the day"
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Loved the course.\nThe lectures were very nice and sufficient for all the exams. The major project was a nice exposure to springboot and development.\nThe grading however, was horrendous. The midsem grading was bad for everyone and the compre grading, though good at average, was bad at higher ranks (av+44 got B).\nOverall the course was taught very well (the only cs course in which the prof actually did coding in the class).\nPapers are standard and if you practice enough Java, it should be a breeze for you."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Terrible course+prof combination, the professor doesn't teach well and expects you to know everything already. The evaluatives were also not great at all. Would recommend properly learning how to code in Java and stick to the slides to do well in the course."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "I did OOPS twice.\nMy only suggestion: Get all the material which he shared   when 22 batch CS folks were doing OOPS. The material is from Ivy League slides. Get all the material which he shared during summer term 2024. This material is way more practical and he made it on his own. Combine everything and do the project, you will be Badshah of OOPS."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "It's a very comfortable course, no annoying evals or quizzes or anything. Probably the easiest course to get a grade in this CS sem if you put a little effort into studying. Aritra is the goat prof, there was one class where the classroom was empty but he gave a lecture anyway so Impartus would have the recording. The textbooks are very verbose but the class slides are enough to study from tbh."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Sir is a very knowledgeable person and more importantly he is a good human being. He was very considerate in evals and made them as fair as possible. Grading kinda sucks for this course but it is what it is. It is not in the hands of IC. His lectures were good, but evals covered way more so i recommend studying  outside of what is covered in class also."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Prof is pretty good. He explains topics reasonably well, but sometimes he overcomplicates it while teaching. His midsem and compre papers are pretty hard and grading was a little harsh for midsem. Otherwise, the course was conducted well"
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "The course was highly theoretical with barely any focus on the actual application of the material. The course covered everything essential to Object Oriented Programming, with more emphasis on Java. The project was interesting and allowed for a deeper understanding of the concepts.\nThe papers were incredibly high scoring, with a sky-high average, overall the average was around 65-70% of the course total, with av + and - 7.5% course total being B-"
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "I hate the guy,  he's probably the first snek prof on campus. He uses only the black board and he proceeds to delete slides and uploads a different set of slides on to cms. Then in the end he'll say slides are not for reference purposes. If you get this prof, use impartus slides and preferable attend classes and refer textbook. Also he's a Java simp, even in PoPL guy set a Java paper"
    }
  ],
  "CS F241": [
    {
      "professor": "Aritra Mukherjee",
      "comment": "His lectures were great, one could really understand what he wants to convey and wrote codes from scratch live to see the working of everything and clear any doubts in the process.\nQuite debatable but I found his assignments to be good too. He almost only asked what he taught in class and took the assignments seriously and they were individual too, thus low averages:) Only issue was his bad mids grading(compre not out yet) and evaluations had poor execution at times.\nI really feel like I learnt something properly from this course."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Expects you to have a sound understanding of java beforehand so if you don’t have any experience with java then you’ll need to learn the basics on your own. He usually asks  theory from his slide so read his slides thoroughly."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "The course+prof combo will teach you everything you ever need to know related to oops but you need to put in double the effort to keep up with the coursework. Every topic is kinda rushed up but it's useful at the end of the day"
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Loved the course.\nThe lectures were very nice and sufficient for all the exams. The major project was a nice exposure to springboot and development.\nThe grading however, was horrendous. The midsem grading was bad for everyone and the compre grading, though good at average, was bad at higher ranks (av+44 got B).\nOverall the course was taught very well (the only cs course in which the prof actually did coding in the class).\nPapers are standard and if you practice enough Java, it should be a breeze for you."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Terrible course+prof combination, the professor doesn't teach well and expects you to know everything already. The evaluatives were also not great at all. Would recommend properly learning how to code in Java and stick to the slides to do well in the course."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "I did OOPS twice.\nMy only suggestion: Get all the material which he shared   when 22 batch CS folks were doing OOPS. The material is from Ivy League slides. Get all the material which he shared during summer term 2024. This material is way more practical and he made it on his own. Combine everything and do the project, you will be Badshah of OOPS."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "It's a very comfortable course, no annoying evals or quizzes or anything. Probably the easiest course to get a grade in this CS sem if you put a little effort into studying. Aritra is the goat prof, there was one class where the classroom was empty but he gave a lecture anyway so Impartus would have the recording. The textbooks are very verbose but the class slides are enough to study from tbh."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Sir is a very knowledgeable person and more importantly he is a good human being. He was very considerate in evals and made them as fair as possible. Grading kinda sucks for this course but it is what it is. It is not in the hands of IC. His lectures were good, but evals covered way more so i recommend studying  outside of what is covered in class also."
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "Prof is pretty good. He explains topics reasonably well, but sometimes he overcomplicates it while teaching. His midsem and compre papers are pretty hard and grading was a little harsh for midsem. Otherwise, the course was conducted well"
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "The course was highly theoretical with barely any focus on the actual application of the material. The course covered everything essential to Object Oriented Programming, with more emphasis on Java. The project was interesting and allowed for a deeper understanding of the concepts.\nThe papers were incredibly high scoring, with a sky-high average, overall the average was around 65-70% of the course total, with av + and - 7.5% course total being B-"
    },
    {
      "professor": "Aritra Mukherjee",
      "comment": "I hate the guy,  he's probably the first snek prof on campus. He uses only the black board and he proceeds to delete slides and uploads a different set of slides on to cms. Then in the end he'll say slides are not for reference purposes. If you get this prof, use impartus slides and preferable attend classes and refer textbook. Also he's a Java simp, even in PoPL guy set a Java paper"
    }
  ],
  "CS F303": [
    {
      "professor": "Paresh Saxena",
      "comment": "The course material is quite interesting, and the textbook by Kurose teaches is really well, but is the only good thing about the course. With Paresh sir at the helm, everything else about the course (aka the evaluation and the teaching) was about as painful as it could be. Being forced to come to class for fear of surprise quizzes is already not great, but he really isn't too good at 'teaching' either. Moreover, the labs were genuinely some of the biggest wastes of time I have ever experienced, with the only learning (if any) happening BEFORE the lab while preparing in case they took a lab exam; the labsheets were awfully made with barely any proper explanations, and if they had any code then basically the entire lab would go in trying to fix it to get it to run. His class quizzes were also questionable at best, with one of them having a completely incorrect answer key that I don't believe we ever got to fix because it was taken so late that lectures ended soon after it."
    },
    {
      "professor": "Paresh Saxena",
      "comment": "His evaluation scheme is very bad. He told evaluative lectures and this was supposed to be a surprise component but in the end what he did is he only took 1 until the last 2 classes and then it was pretty scammish. He is fine-ish in teaching. You should have tolerance for fake accent tho."
    },
    {
      "professor": "Paresh Saxena",
      "comment": "anything paresh teaches should not be a compulsory course"
    },
    {
      "professor": "Paresh Saxena",
      "comment": "This man should not take any CDCs. He may be good at the subject but he's not good at teaching (or evaluating). His answer keys keep having mistakes but as usual he won't correct it because he just doesn't have the time. The lab component of the course was just a massive waste of time as we learnt pretty much nothing in it. We'd just walk in, wait around for 30 min after which it's either a lab test for 30 min or everyone leaves. He goes on leave pretty often (as he has to attend conferences), due to which he speedran the post-midsem part of the course. My saving grace in this course was Mr Jim Kurose and his videos and resources, you can use that for Computer Networks specifically. If you meet him in some other course, I hope you find someone else to save you."
    }
  ],
  "CS F342": [
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "the guy is a meme, he fucked up every single component of the course (do note it's a 4 cred course). he gave free marks to people who didn't actually deserve those marks in quiz 1. in lab test 1, his TAs only didn't follow his marking scheme. in midsems, he gave 5 questions 12 marks each and did binary marking (either +12 or 0). quiz 2 was fine but in class he told he'll consider other forms of marking such as bubbling and all but while correcting he told he won't consider cause i supposedly \"cheated\" by using bubbles and not ticks. in lab test 2, he basically somehow ended up leaking the paper and then everyone got 20 except those who didn't attend the test itself (they got makeup later). This was a course which had an average of 30 out of 120 and he increased to around 48. compre correction was one more fuck up. I can clearly see my answer is correct but the guy argues it's wrong and am not on campus. i hope he doesn't get any course ever again."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Good course material. The professor however gave me enough depression that I wish I could get a CLR."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Course was very hard to follow, it seemed like even sir himself was confused a lot of the time. They gave lab tests where very few people actually managed to get the answer, and the pattern of quiz papers was unclear until the end. Much skill issue, course was not fun to go through."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "The course is a good and thorough introduction to Assembly and the architecture behind computers and processors. The material was complete and served to create a good base which the quizzes, examinations, and labs solidified. \nUnfortunately, there were mishaps throughout every single evaluation due to the instructor in charge and his miscommunications with the Ph.D. TAs, FD TAs, and other professors involved in the course, making it an incredibly painful experience to go through."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Hearing the name of that course and professor makes me feel depressed. Every evaluation was messed up."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Never seen a bigger shitshow. He is confused while teaching , constantly keeps teaching wrong things then corrects himself 20 minutes later. Every evaluation component had some or the other problem the worst being giving marks for a question only if all subparts were exactly correct (+12/+0). His teaching slides are just pictures taken from the textbook and compre paper questions were picked up from some foreign University paper. Asked problems on topics he hasn't even mentioned but \"was in the books so you should have known\". Easily the worst experience I've had with an ic and a course. Avoid courses taken by him."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "A very interesting course for anyone who wants to go into core as a career, the course content is very well designed and constructed, and the teaching is pretty decent as well. The grading is a little harsh. The project is very useful in helping you apply the concepts taught in class, however the labs have a very steep learning curve for anyone who is unfamiliar with verilog or not doing FPGA simultaneously. Overall an amazing course and worth doing if you want to pursue a career in an allied field, since it gives you a good understanding of the fundamentals of how processors work and how to optimize them."
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Course: 1- Need to practise to score good. (PYQs>Tuts>TB exercises).\n2- To me was easier than MPI.\n3- Lab is based on MIPS(Assembly lang), for us (22 batch, sem 1) was way easier. Just attend the labs, save your code (do take back up on drive, otherwise someone might delete your local files) and reuse it on the day of surprise evaluation.\nProf (Geetha Ma'am): 1- Explains concept like she is teaching a 8th class kid.\n2- Do go through her PYQs before midsems and compres as the paper is nearly the same.\n3- Makes us do lot of computational labour in exams, so your speed in midsems matter (if you are able to completely attempt all questions in midsem within time then you are not human.)"
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Prof is good (better than the rest) but course itself is much harder than other cs courses"
    },
    {
      "professor": "Rajib Ranjan Maiti",
      "comment": "Wonderful Professor,but people who watch lectures on impartus and accustomed to 2x learning speed may not enjoy her teaching as much as she tends to be repetitive, but it's perfect for a live offline setting.Do PYQs and get previous year tutorials from Dev Gala Acad Drive, you can easily ensure an A in this course. Labs again are pretty chill, they're just nominal, almost everybody scored 60/60 in these labs. Mids and Compres make your grade"
    }
  ],
  "CS F363": [
    {
      "professor": "Raghunath Reddy Madireddy",
      "comment": "Very nice prof and very nice course. I liked it a lot, but the assignment was a bit heavy. More time could have helped and the assignment statement was very vague but yeah it was doable I guess? Can't really tell until he gives feedback. The course itself is very practical based. You will learn more if you actually implement all the things being taught but yeah it is what it is. The prof claims he would not let the next batch use Lex and Yacc and hopefully that's for the best. The course goes into depths of how a compiler actually works. Pre midsem stuff is pretty much based on syntactical analysis and takes up a lot of time, especially the parser stuff. The midsem grading was decent but both midsem and compre including coding questions from lab, so you will need to remember all these as well."
    },
    {
      "professor": "Raghunath Reddy Madireddy",
      "comment": "Nasty IC. Gave all possible evals like tut eval, lab eval, project, lab test. IC mentioned that we should not study for grade, bro feels we are doing some masters in compilers."
    },
    {
      "professor": "Raghunath Reddy Madireddy",
      "comment": "Teaches the subject very well, and I loved the second assignment (especially the part where everyone was suffering) wherein we had to make a compiler for a simple language. The subject is pretty interesting if you're interested in the theoretical understanding of how programming languages work, and since the same professor took TOC for me, i'd say it was a good combined experience."
    }
  ],
  "CS F364": [
    {
      "professor": "Tathagata Ray",
      "comment": "The professor goes a bit slow for my liking but is fine (God bless 2x Impartus). The professor teaches well, and the course also has atleast one heavy assignment where you'll be implementing an algorithm you learn in the course along with analysis on it (and visualization because TRay loves computer graphics and geometry). Overall, the course material is pretty good if you're into theoretical CS, and are interested in working on algorithms with some solid mathematics. If not, then uh cope somehow I suppose."
    }
  ],
  "CS F372": [
    {
      "professor": "Barsha Mitra",
      "comment": "The only deadly thing in this course are the assignments. They make or break your grade more than midsemesters or compres. Start assignments beforehand, and try your very best not to resort to plagiarism. Apart from this, the professor is chill and most of the paper will be from what he taught in lectures. His slides are enough for the course and the textbook is also a very good supplement if the slides don't make sense. Before exams he does lectures where he solves problems and those along with textbook problems are usually what show up in the test."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "Very nice prof, explains nicely and ensures all of us actually understand the concepts. Also allows laptops in classes lmao unlike some other profs."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "Great course, ma'am explains concepts and clears doubts very well. Assignments were also fun to figure out. Average was always quite high though, so after messing up one eval it was very difficult to bring grade back up."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "Good course, very informative. Assignments were in C and very easy, and compre was full of standard problems. (avg was 94.5/120)\n\nWill be very useful for placements."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "The course material was made easy to understand by the professor and covered all the necessary information with regard to operating systems and their working. The slides shared were very thorough.\nThe assignments were helpful in understanding the material, however, the scoring for all assignments was incredibly lenient and the comprehensive examination was incredibly easy, with an average of 95+ out of 120.\nThis led to the entire course being decided based on the midem examination alone."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "Great course and prof as well. Explains all concepts really well in class. Assignments in C are quite hard and consist of a significant weightage as well so do them properly. One issue that can come up is that the compre is very high scoring since mostly standard problems are asked in the paper."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "The course content is easy and maam teaches very well. Watching impartus and following her slides is more than enough. The projects are difficult so it’s better to find a good team."
    },
    {
      "professor": "Barsha Mitra",
      "comment": "Do as many gate pyqs as you can for mids and compre. Go to sk Aziz sirs tuts for hands-on coding experience. For assignment maintain a good friend circle who can help you with it (if uve sneks for friends you'll lose 2-3 grades to absolutely undeserving ppl with half your mids compre scores)"
    },
    {
      "professor": "Barsha Mitra",
      "comment": "Assignments are very very very crucial for your grade. Make sure to start them on day 1 and try on your own. Do NOT do the mistake of using ChatGPT/StackOverflow/Github Repos. \nSir gave approx 100 students 0s.Image A 0 in 105/300 marks!!\nTake them very seriously\nAs for the midsems and compres. They're pretty lite. Do GATE PYQs and read slides.You'll score full. Just take care of the assignments and you can ensure an A- atleast with a breeze"
    }
  ],
  "CS F407": [
    {
      "professor": "J Jabez Christopher",
      "comment": "In one word: Terrible.\nThe slides are borrowed from some other university but Abhijit Das fails to explain anything that is present in the slides.\nHe goes on to contradict his own statements in the span of a few minutes and tends to give incorrect information even when the correct information is present on the slide right behind him.\nHe does not explain any topic that he takes up and just talks randomly about that topic and marks the topic as covered in class.\nIf you happen to ask him a doubt in early days of the course, his answers will leave you more confused than anything else. If you happen to ask a doubt in the later stage of the course, he will push the blame on you saying that he covered this topic in his classes and you should’ve attended/paid attention.\nBy the end of the course, you will be left with over 100+ topics to study because he didn’t teach any but they are there in the syllabus even if not in the handout. And you would have to do it all without any study material because his lectures aren’t worth watching.\nThe project of the course in itself might be fine but he will not give clear guidelines of the project and will not entertain doubts regarding it as well, leaving you in the dark for the entirety of the course.\nPapers would be standard and the so would be the grading. But to endure the course is a task.\nOver all 0/10. Avoid at all costs."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "The course is designed as per his own research work. Till midsems its basically search algorithms based on every creature that exists like ant/squirrel/cuckoo etc etc.\nOne part of the course deals with propositional and predicate logic thus CS students have a slight advantage (15 marks in midsem and 15 in compre were for this in a 200 marks course). Post mids he thought Bayesian Belief Networks , Fuzzy Inference systems and brushed over supervised and Unsupervised learning. Basically you will get an idea on every topic but will not go in too much depth.\nLite course in my opinion and can score good if followed his lectures.\nOverall the guy is a cutie!"
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "Nice prof , little bit slow in teaching but you can watch on impartus at 2x . Mostly he tells whether there will be surprise quiz or not. Easy course (can also watch any youtube videos to understand all concepts and score high) . Checking is very linient ."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "First part of course was slightly boring for me as it contained various search algorithms such as dfs,bfs and then moving onto ant-colony optimization and particle swarm optimization. But then it picks up speed with various supervised and unsupervised learning techniques such as naive bayes, knn, k-means clustering, decision trees, information theory etc as well as an intro to fuzzy information systems. At the end it concludes with an intro to image processing and case-based reasoning. Second part of the course was more interesting for me but the comprehensive exam was quite length, however the correction was quite lenient. Wasn't very fond of sir's teaching style but overall the course and its logistics were good."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "Course is quite extensive for a student who wants to explore the field of artificial intelligence and machine learning.It try to cover all kind of topics related the field and tries to give a base for proceeding with additional advanced courses related to the same field.\nThe grading is also decent and the project if done properly is resume worthy and helps get a good grasp of concepts by applying them practically."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "Prof doesn't teach well, you need to study everything on your own. Also his voice drones on and on & just very boring classes in general. Grading wise, he gave B at av+8 but gave very few As. There is 1 project throughout the sem with midsem and compre evaluation. It's lite if you put in the most basic effort. Course content is interesting."
    },
    {
      "professor": "J Jabez Christopher",
      "comment": "First half of the course is search algorithms, how to optimise choice making by various algorithms, all sorts of swarm optimisations. This is easy if you've done DSA prep. Almost 40 people dropped the course so the av jumped by 11 marks LMAO. Second half of the course is more towards ML like fuzzy logic, linear/logistic regression, classification models, Naive Bayes, neural networks. It's a pretty easy course, sir uploaded slides for our sem but idk about others. Grading and papers are standard"
    }
  ],
  "CS F415": [
    {
      "professor": "Aruna Malapati",
      "comment": "Aruna ma'am is quite good at explaining the concepts, I would say she is one of the best teachers in the CS department. Ma'am doesnt upload slides and marks until last minute but you will learn a lot in this course. Grading is good and exams are quite straightforward if you attend classes. Strongly recommend taking this course, it is an easy DEL, especially if you know basics of ML."
    }
  ],
  "CS F433": [
    {
      "professor": "Venkatakrishnan Ramaswamy",
      "comment": "I took the course in my 4th year. Course content is fairly simple: he starts out with basic biology content about the neural system, and then proceeds to build on that knowledge with progress in neuroscience. It can be a bit chaotic at times because he does not stick to the schedule, but he is a very passionate professor who knows the subject. Evaluations are very lite; the assignment was implementing Hopcroft networks using Python, and for the final project we had to read a couple of papers (he suggested a few, but I more or less presented what I wanted to). Exams are also very lite and test you based on what's taught in class. Neuroscience is not even tangentially related to what I'm interested in, but I took the course because I like the professor and his Outlook towards teaching and research in general, and was able to take home a lot. Fun course, overall!"
    }
  ],
  "CS F436": [
    {
      "professor": "Venkatakrishnan Ramaswamy",
      "comment": "I took the course in my 4th year. Course content is fairly simple: he starts out with basic biology content about the neural system, and then proceeds to build on that knowledge with progress in neuroscience. It can be a bit chaotic at times because he does not stick to the schedule, but he is a very passionate professor who knows the subject. Evaluations are very lite; the assignment was implementing Hopcroft networks using Python, and for the final project we had to read a couple of papers (he suggested a few, but I more or less presented what I wanted to). Exams are also very lite and test you based on what's taught in class. Neuroscience is not even tangentially related to what I'm interested in, but I took the course because I like the professor and his Outlook towards teaching and research in general, and was able to take home a lot. Fun course, overall!"
    }
  ],
  "CS F437": [
    {
      "professor": "Lalita Bhanu Murthy Neti",
      "comment": "Course was very good, got to learn a lot of new things, including GANs, Flows, Energy Models etc etc. It's a sneek peak into the world of Gen AI. But being a Bhanu course, it was very math intensive. Definitely not an easy one, you'll have to put effort in understanding things."
    }
  ],
  "CS F469": [
    {
      "professor": "Prajna Devi Upadhyay",
      "comment": "I absolutely loved the course in terms of course curriculum and topics covered. It is something new and quite a niche field. But it will expose you to quite interesting algorithms and comes in handy during your interviews for software roles as well. Ma'am gives very challenging Assignments + Viva, less number of A's, but worth taking the course coz 1. Gives you a project on your resume, 2. Knowledge wise you will learn a lot. Ma'am isn't the best at teaching, but she entertains doubts and she re-did the topics that went by too fast because of midsem feedback."
    },
    {
      "professor": "Prajna Devi Upadhyay",
      "comment": "I think she should not be allowed to take any course. She thinks she knows stuff but clearly she doesn't. Her midsem was a meme paper, she asked 5 markers for 1 mark and 1 marker for 5 marks. She goes very fast and upon asking the SFC to ask her to slow down twice she did to a bit. She assumed people understood everything. Her assignments have very high weight and are hard try to start well in advance and don't keep them till the end. She just reads slides out and that also not very nicely."
    },
    {
      "professor": "Prajna Devi Upadhyay",
      "comment": "Took this course out of great interest but it had a lot of memorization. Ma'am basically read out the slides and went pretty fast as well. Assignments were very heavy and tough to implement, but were of good value and learning. Due to her speed of teaching, ma'am covered a lot of content, so better to start early (even the assignment). But this was ma'am's first course, so hoping the course structure and methodology will get better with time."
    },
    {
      "professor": "Prajna Devi Upadhyay",
      "comment": "Very useful course for placements, especially if you plan to sit for DS roles. Ma'am covers a lot of content but most of it is easy so you can get a good grade if you attend classes and study for a day or two before the exam. The projects(assignments) ma'am will give are pretty good, and you can put atleast one of them on your resume. Grading is standard CS grading at B- at av."
    }
  ]
}